_Rarzrabotki/Rarus/USO2/Catalogs/АУН_ОбъектыНедвижимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>АУН_ОбъектыНедвижимости</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКвартиры</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНедвижимости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УПН_ТипыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Этаж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектЭксплуатации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АУН_КатегорииОбъектовНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подъезд</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонНаименования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеОбъекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АУН_НазначенияОбъектовНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринадлежитОбъекту</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АУН_ОбъектыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/УПН_ЦеныОбъектовНедвижимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>УПН_ЦеныОбъектовНедвижимости</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТипОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УПН_ТипыОперацийСНедвижимостью</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаЗаЕдиницуПлощади</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектНедвижимости</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АУН_ОбъектыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/УСОERP_СоответствиеДоговоровИДолей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>УСОERP_СоответствиеДоговоровИДолей</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Расторгнут</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Агент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УПН_СтатусыДокументовПоСделке</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоговорАгента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбщаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВознаграждения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Доля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АУН_ОбъектыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/УПН_ПлощадиОбъектовНедвижимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>УПН_ПлощадиОбъектовНедвижимости</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбщаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЖилаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЖилыхКомнат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектНедвижимости</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АУН_ОбъектыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/УПН_ТипыОперацийСНедвижимостью.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>УПН_ТипыОперацийСНедвижимостью</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Продажа</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/УПН_СтатусыДокументовПоСделке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>УПН_СтатусыДокументовПоСделке</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаСогласовании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласовано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подписано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/УПН_ВидыОперацийРегистрацияПараметровОбъектовНедвижимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>УПН_ВидыОперацийРегистрацияПараметровОбъектовНедвижимости</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИзменениеПлощадей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТехническаяИнвентаризация</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/АУН_КатегорииОбъектовНедвижимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>АУН_КатегорииОбъектовНедвижимости</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Квартира</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Комната</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Здание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Помещение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/УПН_РегистрацияЦенОбъектовНедвижимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>УПН_РегистрацияЦенОбъектовНедвижимости</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.УПН_ЦеныОбъектовНедвижимости</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УПН_ТипыОперацийСНедвижимостью</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АУН_ОбъектыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЦеныОбъектовНедвижимости</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектНедвижимости</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АУН_ОбъектыНедвижимости</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаЗаЕдиницуПлощади</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЦены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/АУН_ОбъектыНедвижимости/Forms/УПН_ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбщиеПроцедурыИФункции
&НаСервере
Функция ЗаписатьЦеныОбъектаНаСервере(СсылкаНаДокументРегистрацииЦен,ОписаниеОшибки)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаНовыхЦен", 	Цены.Выгрузить());
	Запрос.УстановитьПараметр("ОбъектНедвижимости", Объект.Ссылка);
	Запрос.УстановитьПараметр("ТекущаяДата", 		ТекущаяДата());
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаНовыхЦен.ТипЦены,
	|	ТаблицаНовыхЦен.ЦенаЗаЕдиницуПлощади КАК Цена,
	|	ТаблицаНовыхЦен.Стоимость
	|ПОМЕСТИТЬ ТабицаНовыхЦен_ВТ
	|ИЗ
	|	&ТаблицаНовыхЦен КАК ТаблицаНовыхЦен
	|ГДЕ
	|	ТаблицаНовыхЦен.ЦенаЗаЕдиницуПлощади > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА УПН_ЦеныОбъектовНедвижимостиСрезПоследних.Период = НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ)
	|			ТОГДА УПН_ЦеныОбъектовНедвижимостиСрезПоследних.Регистратор
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.УПН_РегистрацияЦенОбъектовНедвижимости.ПустаяСсылка)
	|	КОНЕЦ КАК Регистратор,
	|	ТабицаНовыхЦен_ВТ.ТипЦены КАК ВидЦены,
	|	ТабицаНовыхЦен_ВТ.Цена КАК ЦенаЗаЕдиницуПлощади,
	|	ТабицаНовыхЦен_ВТ.Стоимость,
	|	ЕСТЬNULL(УПН_ЦеныОбъектовНедвижимостиСрезПоследних.ЦенаЗаЕдиницуПлощади, 0) КАК ЦенаЗаЕдиницуПлощадиИзРегистра
	|ПОМЕСТИТЬ НовыеЦеныОбъекта
	|ИЗ
	|	ТабицаНовыхЦен_ВТ КАК ТабицаНовыхЦен_ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УПН_ЦеныОбъектовНедвижимости.СрезПоследних(
	|				&ТекущаяДата,
	|				ТипОперации = ЗНАЧЕНИЕ(Перечисление.УПН_ТипыОперацийСНедвижимостью.Продажа)
	|					И ОбъектНедвижимости = &ОбъектНедвижимости) КАК УПН_ЦеныОбъектовНедвижимостиСрезПоследних
	|		ПО ТабицаНовыхЦен_ВТ.ТипЦены = УПН_ЦеныОбъектовНедвижимостиСрезПоследних.ВидЦены
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НовыеЦеныОбъекта.Регистратор,
	|	НовыеЦеныОбъекта.ВидЦены,
	|	НовыеЦеныОбъекта.ЦенаЗаЕдиницуПлощади,
	|	НовыеЦеныОбъекта.Стоимость
	|ИЗ
	|	НовыеЦеныОбъекта КАК НовыеЦеныОбъекта
	|ГДЕ
	|	НовыеЦеныОбъекта.ЦенаЗаЕдиницуПлощади <> НовыеЦеныОбъекта.ЦенаЗаЕдиницуПлощадиИзРегистра";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Если Выборка.Количество()>0 Тогда //есть измененные цены
		
		Отбор = Новый Структура;
		Отбор.Вставить("Доля", Объект.Ссылка);
		АктуальныеЗаписиРС = РегистрыСведений.УСОERP_СоответствиеДоговоровИДолей.СрезПоследних(ТекущаяДата(), Отбор); 
		Если АктуальныеЗаписиРС.Количество() <> 0 Тогда 
			СтрокаРС = АктуальныеЗаписиРС[0];
		Иначе
			СтрокаРС = Неопределено;
		КонецЕсли;
		
		ДокументРегистрацияЦен = Документы.УПН_РегистрацияЦенОбъектовНедвижимости.СоздатьДокумент();
		ДокументРегистрацияЦен.ТипОперации 	= Перечисления.УПН_ТипыОперацийСНедвижимостью.Продажа;
		ДокументРегистрацияЦен.Дата 		= ТекущаяДата();
		Если СтрокаРС <> Неопределено Тогда
			ДокументРегистрацияЦен.Организация 	= СтрокаРС.Договор.Организация;
			ДокументРегистрацияЦен.Здание 		= СтрокаРС.Доля.ОбъектЭксплуатации;
		КонецЕсли;
		ДокументРегистрацияЦен.Здание = Объект.ПринадлежитОбъекту;
		
		ДокументРегистрацияЦен.Заполнить(Неопределено);
		
		Пока Выборка.Следующий() Цикл
			Если Не ЗначениеЗаполнено(Выборка.Регистратор) Тогда
				НоваяСтрока = ДокументРегистрацияЦен.ЦеныОбъектовНедвижимости.Добавить();
				НоваяСтрока.ОбъектНедвижимости = Объект.Ссылка;
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка); 
			Иначе
				Попытка
					РегистрацияЦенНаИзменение = Выборка.Регистратор.ПолучитьОбъект();
					Отбор = Новый Структура;
					Отбор.Вставить("ОбъектНедвижимости",	Объект.Ссылка);
					Отбор.Вставить("ВидЦены",				Выборка.ВидЦены);
					СтрокиДокумента = РегистрацияЦенНаИзменение.ЦеныОбъектовНедвижимости.НайтиСтроки(Отбор);
					СтрокаДокумента = СтрокиДокумента[0];
					СтрокаДокумента.ЦенаЗаЕдиницуПлощади 	= Выборка.ЦенаЗаЕдиницуПлощади;
					СтрокаДокумента.Стоимость 				= Выборка.Стоимость;
					РегистрацияЦенНаИзменение.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
				Исключение 
					Сообщить(ОписаниеОшибки());
				КонецПопытки;
			КонецЕсли;
		КонецЦикла;
		ДокументРегистрацияЦен.Записать(РежимЗаписиДокумента.Запись);
		
		Попытка
			ДокументРегистрацияЦен.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Создан документ "+ДокументРегистрацияЦен.Ссылка);
		Исключение
			СсылкаНаДокументРегистрацииЦен = ДокументРегистрацияЦен.Ссылка;
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			Пока ИнформацияОбОшибке.Причина <> Неопределено Цикл
				ИнформацияОбОшибке = ИнформацияОбОшибке.Причина;
			КонецЦикла;
			ОписаниеОшибки = ИнформацияОбОшибке.Описание;
			Возврат Ложь;
		КонецПопытки;
		Возврат Истина;		  
	КонецЕсли;
	Возврат Ложь;
КонецФункции

&НаСервере
Процедура ПрочитатьОбщуюИнформациюНаСервере()
	
	ОбновитьДоступностьЭлементовНаСервере();	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("Дата", ?(ЗначениеЗаполнено(Дата), КонецДня(Дата), '00010101'));
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПлощадиОбъектовНедвижимости.ОбщаяПлощадь,
	|	ПлощадиОбъектовНедвижимости.ЖилаяПлощадь,
	|	ПлощадиОбъектовНедвижимости.КоличествоЖилыхКомнат,
	|	NULL КАК Контрагент,
	|	NULL КАК Договор
	|ИЗ
	|	РегистрСведений.УПН_ПлощадиОбъектовНедвижимости.СрезПоследних(&Дата, ОбъектНедвижимости = &Ссылка) КАК ПлощадиОбъектовНедвижимости
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	NULL,
	|	NULL,
	|	NULL,
	|	ВЫБОР
	|		КОГДА УСОERP_СоответствиеДоговоровИДолей.Статус <> ЗНАЧЕНИЕ(Перечисление.УПН_СтатусыДокументовПоСделке.Отменено)
	|			ТОГДА УСОERP_СоответствиеДоговоровИДолей.Контрагент
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА УСОERP_СоответствиеДоговоровИДолей.Статус <> ЗНАЧЕНИЕ(Перечисление.УПН_СтатусыДокументовПоСделке.Отменено)
	|			ТОГДА УСОERP_СоответствиеДоговоровИДолей.Договор
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ
	|ИЗ
	|	РегистрСведений.УСОERP_СоответствиеДоговоровИДолей.СрезПоследних(&Дата, Доля = &Ссылка) КАК УСОERP_СоответствиеДоговоровИДолей";
	
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Для Каждого КолонкаРеквизит Из Результат.Колонки Цикл
			ИмяРеквизита = КолонкаРеквизит.Имя;
			Если ЗначениеЗаполнено(Выборка[ИмяРеквизита]) Тогда
				ЭтаФорма[ИмяРеквизита] = Выборка[ИмяРеквизита];
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

Запрос = Новый Запрос;

Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
Запрос.УстановитьПараметр("Дата", ?(ЗначениеЗаполнено(Дата), КонецДня(Дата), '00010101'));

Запрос.Текст =
"ВЫБРАТЬ РАЗРЕШЕННЫЕ
|	ПлощадиОбъектовНедвижимости.ОбщаяПлощадь,
|	ПлощадиОбъектовНедвижимости.ЖилаяПлощадь,
|	ПлощадиОбъектовНедвижимости.КоличествоЖилыхКомнат
|ИЗ
|	РегистрСведений.УПН_ПлощадиОбъектовНедвижимости.СрезПоследних(&Дата, ОбъектНедвижимости = &Ссылка) КАК ПлощадиОбъектовНедвижимости";

Результат = Запрос.Выполнить();
Выборка = Результат.Выбрать();

Если НЕ Выборка.Следующий() Тогда //нет данных о регистраци параметров
	
	Если ОбщаяПлощадь+ЖилаяПлощадь+КоличествоЖилыхКомнат>0 Тогда //значения был заполнены при создании элемента
		
		ДокументРегистрацияПараметров = Документы.УПН_РегистрацияПараметровОбъектовНедвижимости.СоздатьДокумент();
		ДокументРегистрацияПараметров.ВидОперации = Перечисления.УПН_ВидыОперацийРегистрацияПараметровОбъектовНедвижимости.ИзменениеПлощадей;
		ДокументРегистрацияПараметров.Дата = Дата;			
		
		НоваяСтрока = ДокументРегистрацияПараметров.ПараметрыОбъектов.Добавить();
		НоваяСтрока.ОбъектНедвижимости = Объект.Ссылка;		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭтаФорма);
		
		ДокументРегистрацияПараметров.Заполнить(Неопределено);
		СделатьСообщение = Ложь;
		
		Если НЕ ЗначениеЗаполнено(ДокументРегистрацияПараметров.Организация) Тогда
			
			СообщениеПредупреждения = Новый СообщениеПользователю;
			СообщениеПредупреждения.Текст = "В документе регистрации параметров объектов недвижимости, не указана организация. Пожалуйста, заполните этот реквизит!
			|Нажмите на это сообщение для открытия окна документа.";
			СделатьСообщение = Истина;
			
		КонецЕсли;
		
		ДокументРегистрацияПараметров.Записать(РежимЗаписиДокумента.Запись);
		
		Если НЕ СделатьСообщение Тогда
			
			Попытка
				
				ДокументРегистрацияПараметров.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
				
			Исключение
				
				СообщениеПредупреждения = Новый СообщениеПользователю;
				СообщениеПредупреждения.УстановитьДанные(ДокументРегистрацияПараметров);
				СообщениеПредупреждения.Текст = "Не удалось провести документ регистрации параметров объектов недвижимости по причине:
				|"+ ОписаниеОшибки()+ "
				|Нажмите на это сообщение для открытия окна документа.";
				СообщениеПредупреждения.Сообщить();
				
			КонецПопытки;
			
		Иначе
			
			СообщениеПредупреждения.УстановитьДанные(ДокументРегистрацияПараметров);				
			СообщениеПредупреждения.Сообщить(); 
			
		КонецЕсли;
		
		КонецЕсли;   
		
	КонецЕсли;	
	
	ОбновитьДоступностьЭлементовНаСервере();
	
КонецПроцедуры 

&НаСервере
Процедура СоздатьДокументРегистрацияПараметровНаСервере(ДанныеФормы)
	
	ДокументРегистрацияПараметров = ДанныеФормыВЗначение(ДанныеФормы, Тип("ДокументОбъект.УПН_РегистрацияПараметровОбъектовНедвижимости"));
	ДокументРегистрацияПараметров.ВидОперации = Перечисления.УПН_ВидыОперацийРегистрацияПараметровОбъектовНедвижимости.ИзменениеПлощадей;
	
	НоваяСтрока = ДокументРегистрацияПараметров.ПараметрыОбъектов.Добавить();
	НоваяСтрока.ОбъектНедвижимости = Объект.Ссылка;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОбъектНедвижимости", Объект.Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПлощадиОбъектовНедвижимости.ОбщаяПлощадь,
	|	ПлощадиОбъектовНедвижимости.ЖилаяПлощадь,
	|	ПлощадиОбъектовНедвижимости.КоличествоЖилыхКомнат
	|ИЗ
	|	РегистрСведений.УПН_ПлощадиОбъектовНедвижимости.СрезПоследних(, ОбъектНедвижимости = &ОбъектНедвижимости) КАК ПлощадиОбъектовНедвижимости";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	Иначе
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭтаФорма);
	КонецЕсли;
	
	ДокументРегистрацияПараметров.Заполнить(Неопределено);
	
	ДокументРегистрацияПараметров.Здание = Объект.Ссылка.ПринадлежитОбъекту;
	
	ЗначениеВДанныеФормы(ДокументРегистрацияПараметров, ДанныеФормы);

КонецПроцедуры

&НаСервере
// Преобразовать строку полей в структуру
Функция ПреобразоватьСтрокуВСтруктуру(СтрокаПолей)
	
	Результат = Новый СписокЗначений;
	ПоследнийЭлемент = Неопределено;
	
	Для Сч = 1 По СтрЧислоСтрок(СтрокаПолей) Цикл
		Стр = СтрПолучитьСтроку(СтрокаПолей, Сч);
		Если Лев(Стр, 1) = Символы.Таб Тогда
			Если ПоследнийЭлемент <> Неопределено Тогда
				ПоследнийЭлемент.Значение = ПоследнийЭлемент.Значение + Символы.ПС + Сред(Стр, 2);
			КонецЕсли;
		Иначе
			Поз = Найти(Стр, "=");
			Если Поз <> 0 Тогда
				ПоследнийЭлемент = Результат.Добавить(Сред(Стр, Поз+1), Лев(Стр, Поз-1));
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	СтруктураПолей = Новый Структура;
	Для Каждого Элемент Из Результат Цикл
		СтруктураПолей.Вставить(Элемент.Представление, Элемент.Значение);
	КонецЦикла;
	
	Возврат СтруктураПолей;
	
КонецФункции

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтаФорма, РеквизитФормыВЗначение("Объект"));
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьЦеныОбъектаНаСервере()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыЦен.Ссылка КАК ТипЦены,
	|	ВидыЦен.ВалютаЦены,
	|	УПН_ЦеныОбъектовНедвижимостиСрезПоследних.ЦенаЗаЕдиницуПлощади,
	|	УПН_ЦеныОбъектовНедвижимостиСрезПоследних.Стоимость
	|ИЗ
	|	Справочник.ВидыЦен КАК ВидыЦен
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УПН_ЦеныОбъектовНедвижимости.СрезПоследних(
	|				,
	|				ОбъектНедвижимости = &Ссылка
	|					И ТипОперации = ЗНАЧЕНИЕ(Перечисление.УПН_ТипыОперацийСНедвижимостью.Продажа)) КАК УПН_ЦеныОбъектовНедвижимостиСрезПоследних
	|		ПО ВидыЦен.Ссылка = УПН_ЦеныОбъектовНедвижимостиСрезПоследних.ВидЦены";
	//|ГДЕ
	//|	ВидыЦен.ИспользоватьПриПродаже";
	
	Запрос.Параметры.Вставить("Ссылка",Объект.Ссылка);
	
	Цены.Загрузить(Запрос.Выполнить().Выгрузить());		
	
КонецПроцедуры

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ УПРАВЛЕНИЯ ВНЕШНИМ ВИДОМ ФОРМЫ

&НаСервере
Процедура ОбновитьДоступностьЭлементовНаСервере() 
	ЭлементСоздан = НЕ Объект.Ссылка.Пустая();
	Элементы.КнопкаИзменить.Видимость = ЭлементСоздан;
	Элементы.ОбщаяПлощадь.ТолькоПросмотр = ЭлементСоздан;
	Элементы.КоличествоЖилыхКомнат.ТолькоПросмотр = ЭлементСоздан;
	Элементы.ЖилаяПлощадь.ТолькоПросмотр = ЭлементСоздан;
	Элементы.Родитель.Доступность = НЕ ЭлементСоздан;
	Элементы.ТипНедвижимости.Доступность = НЕ ЭлементСоздан;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	
	Элементы.Здание.Видимость = Объект.КатегорияОбъекта <> ПредопределенноеЗначение("Перечисление.АУН_КатегорииОбъектовНедвижимости.Здание");
	
КонецПроцедуры                  

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Обработчик механизма "ВерсионированиеОбъектов"
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Дата = ?(ЗначениеЗаполнено(Параметры.Дата), Параметры.Дата, ТекущаяДата());
	ПрочитатьОбщуюИнформациюНаСервере();
	ОбновитьДоступностьЭлементовНаСервере();
	
	Если Объект.Ссылка.Пустая() И ЗначениеЗаполнено(Объект.Родитель) Тогда
		Объект.ОбъектЭксплуатации = Объект.Родитель.ОбъектЭксплуатации;	
	КонецЕсли;
	
	// Обработчик механизма "Свойства"
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Объект", Объект);
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтаФорма, ДополнительныеПараметры);

	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	ПрочитатьОбщуюИнформациюНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// Обработчик механизма "Свойства"
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтаФорма, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Обработчик механизма "Свойства"
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

&НаКлиенте
Процедура ИзменитьДанные(Команда)
	
	Форма = ПолучитьФорму("Документ.УПН_РегистрацияПараметровОбъектовНедвижимости.Форма.ФормаДокумента",, ЭтаФорма);
	ДанныеФормы = Форма.Объект;
	СоздатьДокументРегистрацияПараметровНаСервере(ДанныеФормы);
	КопироватьДанныеФормы(ДанныеФормы, Форма.Объект);
	Форма.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьЦеныОбъекта(Команда)
	ПрочитатьЦеныОбъектаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЦеныСтоимостьПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Цены.ТекущиеДанные;
	Если ЗначениеЗаполнено(ОбщаяПлощадь) Тогда
		ТекущиеДанные.ЦенаЗаЕдиницуПлощади = ТекущиеДанные.Стоимость/ОбщаяПлощадь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЦенаЗаЕдиницуПлощадиПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Цены.ТекущиеДанные;
	ТекущиеДанные.Стоимость = ТекущиеДанные.ЦенаЗаЕдиницуПлощади*ОбщаяПлощадь;
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьЦеныОбъекта(Команда)
	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(,"Элемент справочника необходимо сначала записать!");
		Возврат;
	КонецЕсли;
	СсылкаДокументаРегистрацииЦен = Неопределено;
	ИнформацияОбОшибке = "";
	Если НЕ ЗаписатьЦеныОбъектаНаСервере(СсылкаДокументаРегистрацииЦен,ИнформацияОбОшибке) Тогда
		Если ЗначениеЗаполнено(ИнформацияОбОшибке) Тогда
			ПоказатьЗначение(,СсылкаДокументаРегистрацииЦен);
			ПоказатьПредупреждение(,"Ошибка проведения документа:"+Символы.ПС+ИнформацияОбОшибке,,"Регистрация цен объекта");
		Иначе // в этом случае просто цены не поменялись
			ПоказатьПредупреждение(,"Не обнаружено измений цен данного объекта!",,"Регистрация цен объекта");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КатегорияОбъектаПриИзменении(Элемент)
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
		// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтаФорма, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства

КонецПроцедуры

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

#КонецОбласти
